class InfoList {
  List<Map<String, String>> yearly2017 = [
    {
      "서명": "미움받을 용기",
      "소장위치": "4층 인문과학실",
      "저자명": "고가 후미타케",
    },
    {
      "서명": "채식주의자",
      "소장위치": "5층 문학자료실",
      "저자명": "한강",
    },
    {
      "서명": "지적 대화를 위한 넓고 얕은 지식 :역사, 경제, 정치, 사회, 윤리 편",
      "소장위치": "4층 인문과학실",
      "저자명": "채사장",
    },
  ];
  List<Map<String, String>> yearly2018 = [
    {
      "서명": "82년생 김지영",
      "소장위치": "5층 문학자료실",
      "저자명": "조남주",
    },
    {
      "서명": "나미야 잡화점의 기적",
      "소장위치": "5층 문학자료실",
      "저자명": "히가시노 게이고",
    },
    {
      "서명": "미움받을 용기",
      "소장위치": "4층 인문과학실",
      "저자명": "고가 후미타케",
    },
  ];
  List<Map<String, String>> yearly2019 = [
    {
      "서명": "미움받을 용기",
      "소장위치": "4층 인문과학실",
      "저자명": "고가 후미타케",
    },
    {
      "서명": "채식주의자 :한강 연작소설",
      "소장위치": "5층 문학자료실",
      "저자명": "한강",
    },
    {
      "서명": "지적 대화를 위한 넓고 얕은 지식 :역사, 경제, 정치, 사회, 윤리 편",
      "소장위치": "4층 인문과학실",
      "저자명": "채사장",
    },
  ];
  List<Map<String, String>> yearly2020 = [
    {
      "서명": "미움받을 용기",
      "소장위치": "4층 인문과학실",
      "저자명": "고가 후미타케",
    },
    {
      "서명": "채식주의자 :한강 연작소설",
      "소장위치": "5층 문학자료실",
      "저자명": "한강",
    },
    {
      "서명": "지적 대화를 위한 넓고 얕은 지식 :역사, 경제, 정치, 사회, 윤리 편",
      "소장위치": "4층 인문과학실",
      "저자명": "채사장",
    },
  ];
  List<Map<String, String>> yearly2021 = [
    {
      "서명": "미움받을 용기",
      "소장위치": "4층 인문과학실",
      "저자명": "고가 후미타케",
    },
    {
      "서명": "채식주의자 :한강 연작소설",
      "소장위치": "5층 문학자료실",
      "저자명": "한강",
    },
    {
      "서명": "지적 대화를 위한 넓고 얕은 지식 :역사, 경제, 정치, 사회, 윤리 편",
      "소장위치": "4층 인문과학실",
      "저자명": "채사장",
    },
  ];
}
